# ----------------------- 사족 -----------------------

# [사족1]

# '필사본' 에서 역파생되는 '필사'와, 기성의 낱말 '필사' 는 동음이의적입니다

# '필사-본'  = [필사] 에서 파생된 말 ---> 베낀-본
# '필-사-본' = [필사본] 을 이르는 말 ---> 여기서 역파생된 부분 발화로서의 /필사/는 [필사]와 다름
# '필-사본'  = 아예 처음부터 고안되는 단어 ---> 씀-으로써 사본이 생김, 모양과 지시체는 같을지언정 한자가 다름

# 사전에서 라면야 [대괄호] 쳐진 것만 수록되어 있습니다. 나머지 것들은 /발화/ 입니다.
# 사전에는 없어도 /발화/는 얼마든지 가능합니다. 애초에 발화된 적 없는 것은 수록될 수 없죠.



# [사족2]

# 함수 이름을 지을 때, 그 함수의 '동작의 이름'으로 지을까, '동작의 결과물' 로 지을까를 고민할 수 있습니다
# 함수를 또다른 함수의 매개 변수로 사용하는 상황을 상상해봅시다, F( g(x) )
  
# g(x)의 이름을 그것의 '동작' 으로 짓는다면, g(x)의 return 값이 F의 목적어가 됩니다( g된 것을 F해라 )
#     ---> return 값의 네이밍 센스가 비로소 목적어의 위상을 가집니다
  
# g(x)의 이름을 동작의 '결과물' 로 짓는다면, g(x)의 이름을 목적어처럼 써도 됩니다( g를 F해라 )
#     ---> return 값의 네이밍 센스는 성의가 없어도 됩니다

# 함수는 행위를 지칭하기도 하지만, return 값을 지칭하기도 합니다



# [사족3]

# 객체는 동작이면서 동시에 주체이므로 이름을 짓기가 까다로웁니다
