/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   사망연산자.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: keunykim <keunykim@student.42gyeongsan.    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/04/05 03:31:02 by keunykim          #+#    #+#             */
/*   Updated: 2024/04/05 03:33:18 by keunykim         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <string.h>

int	main(void)
{
	// 노미네이트: Ternaries are forbidden
	printf("%d", 2 > 5 ? 2 : 5);
	return (0);
}
