dc = {
    '코카콜라':900,
    '바나나맛우유':750,
    '비타500':600,
    '삼다수':450
}
#키:값
print(dc)
print(dc['코카콜라']) #900
print(dc['바나나맛우유']) #750
dc = {
    '이름':'이순동',
    '나이':19,
    '직업':'학생',
    '키':175.8
}
print(dc)
print(dc['이름'])
print(dc['나이'])
print(dc['직업'])
print(dc['키'])
movie = {
    '제목':'아바타',
    '평점':9.4,
    '러닝타임':130,
    '장르':'판타지'
}
print(movie)
print(movie['제목'])
print(movie['러닝타임'])
print(movie['장르'])
dc = {
    '이순동':22,
    '이순동': 23,
    '이순동': 24,
}
print(dc)
#dictionary contains duplicate keys-경고
#딕셔너리에 중복된키가 있어서 문제다.
#마지막 키:값 쌍만 들어가있다.
dc = {
    '코카콜라':900,
    '바나나맛우유':750,
    '비타500':600,
    '삼다수':450
}
#키:값
dc['삼다수']=550
print(dc)dc = {
    '코카콜라':900,
    '바나나맛우유':750,
    '비타500':600,
    '삼다수':450
}
#키:값
del dc['삼다수']
print(dc)d1 = {1:'a',2:'b'}
d2 = {1:'a',2:'b'}
d3 = {2:'b',1:'a'}

print(d1==d2)
print(d1==d3)
dc = {
    '코카콜라':900,
    '바나나맛우유':750,
    '비타500':600,
    '삼다수':450
}
dc['카페라떼']=1200
print(dc)dc = {
    '코카콜라':900,
    '바나나맛우유':750,
    '비타500':600,
    '삼다수':450
}
result='코카콜라' in dc
print(result)
result='칠성사이다' in dc
print(result)dc = {
    '코카콜라':900,
    '바나나맛우유':750,
    '비타500':600,
    '삼다수':450
}
if '코카콜라' in dc: #코카콜라 존재하면
   dc['코카콜라']=800 #변경

print(dc)
print(dc['코카콜라']) # 800

dc = {
    '코카콜라':900,
    '바나나맛우유':750,
    '비타500':600,
    '삼다수':450
}
for i in dc:
    print(i, end=' ') #'코카콜라'~
for i in dc:
    print(dc[i], end=' ') #900
dc = {
    '코카콜라':900,
    '바나나맛우유':750,
    '비타500':600,
    '삼다수':450
}
for i in dc:
    dc[i] += 70
print(dc)