/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: keunykim <keunykim@student.42gyeongsan.    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/07/06 04:07:41 by keunykim          #+#    #+#             */
/*   Updated: 2024/07/06 07:52:59 by keunykim         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minitalk.h"
#include <string.h>
#include <stdio.h>

int	main(int argc, char *argv[])
{
	void *p;
	int i = 0;
	while(i < 1000000)
	{
		p++;
		i++;
	}
	printf("%d", i);
}

// 142를 존재 명부에 등록하려면? 64로 나눈 몫(2), 나머지(14)
// Exist[2] = Exist[2] | 0x8000000000000000 >> 14;
// 777을 존재 명부에 등록하려면? 64로 나눈 몫(12), 나머지(9)
// Exist[12] = Exist[12] | 0x8000000000000000 >> 9;
// 등록된 숫자를 꺼내려면?
